IdeaRS.OpenModel.Detail.ReinfBarByTwoPoints
Representing reinforcement bar input by two points in IDEA StatiCa Detail

IdeaRS.OpenModel.Detail.ReinfBarByTwoPoints.#ctor
Constructor

IdeaRS.OpenModel.Detail.ReinfBarByTwoPoints.MasterComponent1
First master component of reinforcement

IdeaRS.OpenModel.Detail.ReinfBarByTwoPoints.MasterComponent2
Second master component of reinforcement

IdeaRS.OpenModel.Detail.ReinfBarByTwoPoints.MasterPoint1
First master point of reinforcement

IdeaRS.OpenModel.Detail.ReinfBarByTwoPoints.MasterPoint2
Second master point of reinforcement

IdeaRS.OpenModel.Detail.ReinfBarByTwoPoints.BarDistance
Vector determining direction of reinforcement layers, vector is defined in local coordinates of first segment

IdeaRS.OpenModel.Detail.ReinfBarByTwoPoints.NumOfLayers
Number of layers

IdeaRS.OpenModel.Detail.ReinfBarByTwoPoints.Distance
Distance between reinforcement layers

IdeaRS.OpenModel.Detail.ReinfBarByTwoPoints.Position1
Offset between first master point and first point of bar

IdeaRS.OpenModel.Detail.ReinfBarByTwoPoints.Position2
Offset between second master point and second point of bar